{"keras_version": "2.0.4", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Bidirectional", "config": {"batch_input_shape": [null, 40, 36], "name": "bidirectional_1", "layer": {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "recurrent_dropout": 0.0, "units": 64, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "go_backwards": false, "bias_constraint": null, "kernel_constraint": null, "unroll": false, "bias_regularizer": null, "unit_forget_bias": true, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "use_bias": true, "name": "lstm_1", "kernel_regularizer": null, "activity_regularizer": null, "implementation": 0, "activation": "tanh", "recurrent_constraint": null}}, "dtype": "float32", "merge_mode": "concat", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_1", "kernel_regularizer": null, "activity_regularizer": null, "units": 40, "bias_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}]}